cyliangtw/amazon-freertos/lib/ota/portable/nuvoton/numaker-iot-m487/aws_ota_pal.c
}

static bool_t prvSPI_FLASH_EraseBank()
{
#define SPI_BANK_START  0x00
#define SPI_BANK_SIZE   0x80000
  bool_t result = pdFALSE;
  // FIX ME
  /* Erase SPI flash 512KB bank before program. */
  result = NVT_SPI_Flash_Bank_Erase(SPI_BANK_START, SPI_BANK_SIZE);
  return result;
}

static bool_t prvContextUpdateImageHeaderAndTrailer( OTA_FileContext_t * C )
{    
    DEFINE_OTA_METHOD_NAME( "prvContextUpdateImageHeaderAndTrailer" );

    bool_t bProgResult;
    BootImageHeader_t xImgHeader;
    BootImageDescriptor_t * pxImgDesc;
    BootImageDescriptor_t xImgDesc;    
    BootImageTrailer_t xImgTrailer;

    memcpy( xImgHeader.cImgSignature,
            AWS_BOOT_IMAGE_SIGNATURE,
            sizeof( xImgHeader.cImgSignature ) );
    xImgHeader.ucImgFlags = AWS_BOOT_FLAG_IMG_NEW;

    /* Pointer to the boot image header in the flash. */
    pxImgDesc = ( BootImageDescriptor_t * ) NVT_BOOT_IMG_HEAD_BASE;
    xImgDesc = *pxImgDesc;
    memcpy( xImgDesc.xImgHeader, &xImgHeader, sizeof(BootImageHeader_t) );
    
    /* Write Boot header to flash. */
    bProgResult = prvFLASH_update(NVT_BOOT_IMG_HEAD_BASE, 
                                    (uint8_t *)&xImgDesc, 
                                    sizeof( BootImageDescriptor_t) );
    
    OTA_LOG_L1( "[%s] OTA Sequence Number: %d\r\n", OTA_METHOD_NAME, pxImgDesc->ulSequenceNum );
    OTA_LOG_L1( "[%s] Image - Start: 0x%08x, End: 0x%08x\r\n", OTA_METHOD_NAME,
                pxImgDesc->pvStartAddr, pxImgDesc->pvEndAddr );

    /* If header write is successful write trailer. */
    if( bProgResult )
    {
        /* Create image trailer. */
        memcpy( xImgTrailer.aucSignatureType, cOTA_JSON_FileSignatureKey, sizeof( cOTA_JSON_FileSignatureKey ) );
        xImgTrailer.ulSignatureSize = C->pxSignature->usSize;
        memcpy( xImgTrailer.aucSignature, C->pxSignature->ucData, C->pxSignature->usSize );

        /* Write trailer to flash. */
        bProgResult = prvFLASH_update(NVT_BOOT_IMG_TRAIL_BASE, (uint8_t *)&xImgTrailer, sizeof( xImgTrailer));        
        OTA_LOG_L1( "[%s] Writing Trailer at: 0x%08x\n", OTA_METHOD_NAME, NVT_BOOT_IMG_TRAIL_BASE );
    }

    return bProgResult;
}

/* Used to set the high bit of Windows error codes for a negative return value. */
#define OTA_PAL_INT16_NEGATIVE_MASK    ( 1 << 15 )

/* Size of buffer used in file operations on this platform (Windows). */
#define OTA_PAL_WIN_BUF_SIZE ( ( size_t ) 4096UL )

/* Attempt to create a new receive file for the file chunks as they come in. */

OTA_Err_t prvPAL_CreateFileForRx( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CreateFileForRx" );

    OTA_Err_t eResult = kOTA_Err_Uninitialized; /* For MISRA mandatory. */

    if( C != NULL )
    {
        if( NVT_SPI_Flash_Init() == ( bool_t ) pdFALSE )
        {
            eResult = kOTA_Err_RxFileCreateFailed;
            OTA_LOG_L1( "[%s] ERROR - Failed to init SPI Flash.\r\n", OTA_METHOD_NAME );
            return eResult;
        }
         
        /* Erase SPI flash 512KB bank before program. */
        if( prvSPI_FLASH_EraseBank() == ( bool_t ) pdFALSE )
        {
            OTA_LOG_L1( "[%s] Error: Failed to erase the flash!\r\n", OTA_METHOD_NAME );
            eResult = kOTA_Err_RxFileCreateFailed;
        }
        else
        {
            pxCurOTADesc = &xCurOTAOpDesc;
            pxCurOTADesc->pxCurOTAFile = C;
            pxCurOTADesc->ulImageOffset = 0;
            OTA_LOG_L1( "[%s] Receive file created.\r\n", OTA_METHOD_NAME );
            C->pucFile = ( uint8_t * ) pxCurOTADesc;
            eResult = kOTA_Err_None;
        }
    }
    else
    {
        eResult = kOTA_Err_RxFileCreateFailed;
        OTA_LOG_L1( "[%s] ERROR - Invalid context provided.\r\n", OTA_METHOD_NAME );
    }

    return eResult; /*lint !e480 !e481 Exiting function without calling fclose.
                     * Context file handle state is managed by this API. */
}


/* Abort receiving the specified OTA update by closing the file. */

OTA_Err_t prvPAL_Abort( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_Abort" );

    /* Check for null file handle since we may call this before a file is actually opened. */
    prvContextClose( C );
    OTA_LOG_L1( "[%s] Abort - OK\r\n", OTA_METHOD_NAME );

    return kOTA_Err_None;
}

/* Write a block of data to the specified file. 
   Returns the number of bytes written on success or negative error code.
*/
int16_t prvPAL_WriteBlock( OTA_FileContext_t * const C,
                           uint32_t ulOffset,
                           uint8_t * const pacData,
                           uint32_t ulBlockSize )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_WriteBlock" );

    int32_t lResult = 0;

    if( prvContextValidate( C ) == pdTRUE )
    {
        /* OTA image 1st block contain Boot Image Descriptor info */
        if( ulOffset == 0 ) 
        {
            BootImageDescriptor_t xDescCopy;
            const BootImageDescriptor_t * pxAppImgDesc;
            pxAppImgDesc = ( BootImageDescriptor_t * ) NVT_BOOT_IMG_HEAD_BASE;
            xDescCopy = *pxAppImgDesc;           /* Copy image descriptor from flash into RAM struct. */
            memcpy((uint8_t *)&(xDescCopy.ulSequenceNum), pacData, 
            sizeof(xDescCopy) - sizeof(BootImageHeader_t) );
            if( pdFALSE == prvFLASH_update(NVT_BOOT_IMG_HEAD_BASE, (uint8_t *)&xDescCopy, 
                                            sizeof( BootImageDescriptor_t) ) )
            {
                OTA_LOG_L1( "[%s] ERROR - FMC write failed\r\n", OTA_METHOD_NAME );
            }
        }
        
        lResult = NVT_SPI_Flash_Block_Write(ulOffset, pacData, ulBlockSize);

        if( lResult < 0 )
        {
                OTA_LOG_L1( "[%s] ERROR - SPI Flash write failed\r\n", OTA_METHOD_NAME );
                /* Mask to return a negative value. */
                lResult = -1; /*lint !e40 !e9027
                                                                * Errno is being used in accordance with host API documentation.
                                                                * Bitmasking is being used to preserve host API error with library status code. */
        }
    }
    else /* Invalid context or file pointer provided. */
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid context.\r\n", OTA_METHOD_NAME );
        lResult = -1; /*TODO: Need a negative error code from the PAL here. */
    }

    return ( int16_t ) lResult;
}

/* Close the specified file. This shall authenticate the file if it is marked as secure. */

OTA_Err_t prvPAL_CloseFile( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CloseFile" );

    OTA_Err_t eResult = kOTA_Err_None;
    int32_t lWindowsError = 0;

    if( prvContextValidate( C ) == pdTRUE )
    {
        if( C->pxSignature != NULL )
        {
            /* Verify the file signature, close the file and return the signature verification result. */
            eResult = prvPAL_CheckFileSignature( C );
        }
        else
        {
            OTA_LOG_L1( "[%s] ERROR - NULL OTA Signature structure.\r\n", OTA_METHOD_NAME );
            eResult = kOTA_Err_SignatureCheckFailed;
        }

        if( eResult == kOTA_Err_None )
        {
            OTA_LOG_L1( "[%s] %s signature verification passed.\r\n", OTA_METHOD_NAME, cOTA_JSON_FileSignatureKey );
            if( prvContextUpdateImageHeaderAndTrailer( C ) == ( bool_t ) pdTRUE )
            {
                OTA_LOG_L1( "[%s] Image header updated.\r\n", OTA_METHOD_NAME );
            }
            else
            {
                OTA_LOG_L1( "[%s] ERROR: Failed to update the image header.\r\n", OTA_METHOD_NAME );
                eResult = kOTA_Err_FileClose;
            }
        }
        else
        {
            OTA_LOG_L1( "[%s] ERROR - Failed to pass %s signature verification: %d.\r\n", OTA_METHOD_NAME,
                        cOTA_JSON_FileSignatureKey, eResult );

