cyliangtw/amazon-freertos/lib/ota/portable/nuvoton/numaker-iot-m487/aws_ota_pal.c
            /* The OTA on program image bank is rejected so erase the bank.  */
            if( prvSPI_FLASH_EraseBank() == ( bool_t ) pdFALSE )
            {
                OTA_LOG_L1( "[%s] Error: Failed to erase the flash! .\r\n", OTA_METHOD_NAME );
                eResult = ( uint32_t ) kOTA_Err_RejectFailed;
            }
            else
            {
                eResult = kOTA_Err_None;
            }
        }
        else if( eState == eOTA_ImageState_Aborted )
        {
            OTA_LOG_L1( "[%s] Aborted image.\r\n", OTA_METHOD_NAME );

            /* The OTA on program image bank is rejected so erase the bank.  */
            if( prvSPI_FLASH_EraseBank() == ( bool_t ) pdFALSE )
            {
                OTA_LOG_L1( "[%s] Error: Failed to erase the flash! .\r\n", OTA_METHOD_NAME);
                eResult = ( uint32_t ) kOTA_Err_AbortFailed ;
            }
            else
            {
                eResult = kOTA_Err_None;
            }
        }
        else if( eState == eOTA_ImageState_Testing )
        {
            eResult = kOTA_Err_None;
        }
        else
        {
            eResult = kOTA_Err_BadImageState;
        }
    }
#endif

    return eResult;
}

/* Get the state of the currently running image.
 *
 * This is simulated by looking for and reading the state from
 * FMC Boot Image Header.
 *
 * We read this at OTA_Init time so we can tell if the MCU image is in self
 * test mode. If it is, we expect a successful connection to the OTA services
 * within a reasonable amount of time. If we don't satisfy that requirement,
 * we assume there is something wrong with the firmware and reset the device,
 * causing it to rollback to the previous code. On Windows, this is not
 * fully simulated as there is no easy way to reset the simulated device.
 */
OTA_PAL_ImageState_t prvPAL_GetPlatformImageState( void )
{
    BootImageDescriptor_t xDescCopy;
    OTA_PAL_ImageState_t eImageState = eOTA_PAL_ImageState_Invalid;
    const BootImageDescriptor_t * pxAppImgDesc;

    pxAppImgDesc = ( const BootImageDescriptor_t * ) NVT_BOOT_IMG_HEAD_BASE; /*lint !e923 !e9027 !e9029 !e9033 !e9079 !e9078 !e9087 Please see earlier lint comment header. */
    xDescCopy = *pxAppImgDesc;

    /**
     *  Check if valid magic code is present for the application image in lower bank.
     */
    if( memcmp( pxAppImgDesc->xImgHeader.cImgSignature,
                AWS_BOOT_IMAGE_SIGNATURE,
                AWS_BOOT_IMAGE_SIGNATURE_SIZE ) == 0 )
    {

        switch( xDescCopy.xImgHeader.ucImgFlags )
        {
            case AWS_BOOT_FLAG_IMG_PENDING_COMMIT:
                eImageState = eOTA_PAL_ImageState_PendingCommit;
                break;
            case AWS_BOOT_FLAG_IMG_VALID:
            case AWS_BOOT_FLAG_IMG_NEW:
                eImageState = eOTA_PAL_ImageState_Valid;
                break;

            default:
                eImageState = eOTA_PAL_ImageState_Invalid;
                break;
        }
            
        
    }

    return eImageState;
}

/*-----------------------------------------------------------*/

/* Provide access to private members for testing. */
#ifdef AMAZON_FREERTOS_ENABLE_UNIT_TESTS
#include "aws_ota_pal_test_access_define.h"
#endif
